Repository: kanghye02/Order-Management
Catalog: locale/*/LC_MESSAGES/django.po
Languages: vi

source: The number in stock must be a positive integer.
vi: Số lượng trong kho phải là số nguyên dương.

source: The base price must be a positive integer.
vi: Giá cơ bản phải là số nguyên dương.

source: Parent category of this category (if any).
vi: Thể loại gốc của thể loại này (nếu có).

source: Product image
vi: URL của hình ảnh sản phẩm.

source: Brief description of the product.
vi: Mô tả ngắn gọn về sản phẩm.

source: The origin price of the product.
vi: giá gốc của sản phẩm.

source: Quantity of the product available in stock.
vi: Số lượng sản phẩm có sẵn trong kho.

source: Number of products sold.
vi: Số lượng sản phẩm đã bán.

source: Date of the order.
vi: Ngày đặt hàng.

source: Status of the order.
vi: Tình trạng của đơn hàng.

source: total cost of order.
vi: tổng chi phí của đơn hàng

source: Price of product at order.
vi: Giá sản phẩm theo đơn hàng.

source: total quantity of products ordered.
vi: tổng số lượng sản phẩm đã đặt hàng.

source: Quantity of each product in the cart.
vi: Số lượng của từng sản phẩm trong giỏ hàng.

source: The number of sales of the best-selling product.
vi: Số lượng bán ra của sản phẩm bán chạy nhất

source: Best Seller
vi: Sản phẩm bán chạy

source: Best Sellers
vi: Sản phẩm bán chạy

source: Brief description of the promotion.
vi: Mô tả ngắn gọn về khuyến mãi.

source: Changes saved
vi: Thay đổi đã lưu

source: Category Detail
vi: Chi Tiết Thể Loại

source: Save changes
vi: Lưu thay đổi

source: Return category list
vi: Quay lại danh sách thể loại

source: Create New Category
vi: Tạo Thể Loại Mới

source: Create category
vi: Tạo thể loại

source: Categories Manage
vi: Quản lý thể loại

source: Category Name
vi: Tên thể loại

source: Delete selected categories
vi: Xóa thể loại đã chọn

source: Create new category
vi: Tạo thể loại mới

source: ORDER
vi: Đơn

source: CATEGORY
vi: T.Loại

source: PRODUCT
vi: S.Phẩm

source: USER
vi: Người Dùng

source: STATISTICS
vi: T.KÊ

source: Login
vi: Đăng Nhập

source: Admin Page
vi: Trang Quản Lý

source: Filter
vi: Bộ Lọc

source: Start Date
vi: Thời Gian Bắt Đầu

source: End Date
vi: Thời Gian Kết Thúc

source: Price Range
vi: Khoảng Giá

source: Min price
vi: Giá nhỏ nhất

source: Max price
vi: Giá lớn nhất

source: Refresh
vi: Xóa lọc

source: Apply
vi: Lọc

source: All
vi: Tất Cả

source: Pending
vi: Đang xử lý

source: Ongoing
vi: Đang Thực Hiện

source: Cancelled
vi: Đã Hủy

source: Rejected
vi: Từ chối

source: Completed
vi: Hoàn Thành

source: Customer
vi: Khách Hàng

source: Status
vi: Trạng Thái Đơn Hàng

source: Order Date
vi: Thời Gian Đặt

source: Total Cost
vi: Thành Tiền

source: Delete
vi: Xóa

source: Reject
vi: Từ Chối

source: Accept
vi: Chấp Nhận

source: Product Detail
vi: Chi tiết sản phẩm

source: Return product list
vi: Quay lại danh sách sản phẩm

source: Create New Product
vi: Tạo Sản Phẩm Mới

source: Create product
vi: Tạo sản phẩm

source: Products Manage
vi: Quản Lý Sản Phẩm

source: Name
vi: Tên

source: Category
vi: Thể loại

source: Stock
vi: Số Lượng

source: Sold
vi: Đã Bán

source: Price
vi: Giá

source: Promo
vi: K.Mãi

source: Action
vi: Hành Động

source: Delete Promotion
vi: Xóa K.M

source: Set
vi: Đặt K.M

source: Page
vi: Trang

source: of
vi: trên

source: next
vi: tiếp

source: Delete selected products
vi: Xóa sản phẩm đã chọn

source: --------or--------
vi: --------hoặc--------

source: Create new product
vi: Tạo sản phẩm mới

source: Set Promotion
vi: Thiết Lập K.Mãi

source: Discount Percent
vi: Phần Trăm Giảm Giá

source: Description
vi: Mô Tả

source: Close
vi: Đóng

source: TODAY'S ORDER STATISTICS
vi: THỐNG KÊ ĐƠN HÀNG HÔM NAY

source: Day
vi: Ngày

source: Revenue
vi: Doanh thu

source: Number Of Orders
vi: Số lượng sản phẩm đã bán.

source: STATISTICAL CHART
vi: BIỂU ĐỒ THỐNG KÊ

source: Filter:
vi: Lọc:

source: Day from
vi: Ngày từ

source: To
vi: Đến

source: Please make sure the start and end dates are accurate!!!
vi: Hãy chắc chắn bạn đã chọn ngày bắt đầu và kết thúc một cách chính xác !!!

source: User Detail
vi: Chi Tiết Người dùng

source: Return user list
vi: Quay lại danh sách người dùng

source: Create New User
vi: Tạo Người Dùng Mới

source: There was an error with your submission:
vi: Đã xảy ra lỗi với nội dung bạn gửi:

source: Pass Confirm:
vi: Xác nhận mật khẩu:

source: Create user
vi: Tạo người dùng

source: Users Manage
vi: Quản Lý Người Dùng

source: Delete selected users
vi: Xóa người dùng đã chọn

source: Create new user
vi: Tạo người dùng mới

source: SHOPPING CART
vi: GIỎ HÀNG

source: YOUR ORDERS
vi: Đơn Của Bạn

source: Product Name
vi: Tên món

source: Quantity
vi: Số Lượng

source: Total
vi: Thành Tiền

source: Order
vi: Đặt Hàng

source: There are no products in your cart, please add products to cart!!!
vi: Không có món trong giỏ hàng của bạn, hãy thêm món vào giỏ hàng trước khi đặt!!!

source: Our Menu
vi: Thực Đơn Của Chúng Tôi

source: Search:
vi: Tìm kiếm:

source: Search for food here
vi: Tìm món ăn ở đây

source: By Sold Number
vi: Theo Số Lượng Bán

source: By Promotion
vi: Theo Khuyến Mãi

source: Sold:
vi: Đã Bán:

source: View More
vi: Chi tiết

source: There are no products matching the search results!!!
vi: Không có món nào phù hợp với kết quả tìm kiếm của bạn!!!

source: YOUR ORDER
vi: Đơn Của Bạn

source: User's Information:
vi: Thông Tin Người Dùng:

source: Name:
vi: Tên:

source: Please enter your name.
vi: Hãy thêm tên của bạn.

source: User's Phone Number:
vi: Số Điện Thoại Người Dùng:

source: Please enter your phone number.
vi: Hãy thêm số điện thoại của bạn.

source: User's Address:
vi: Địa Chỉ:

source: Please enter your address.
vi: Hãy nhập địa chỉ của bạn

source: User's Email:
vi: Email Người Dùng:

source: Your order is being approved by admin, please wait a little longer!
vi: Đơn hàng của bạn đang được kiểm duyệt bởi admin, hãy chờ thêm một chút thời gian

source: Your information is incomplete, please update all information before ordering!!!
vi: Thông tin của bạn chưa hoàn thiện, hãy cập nhật thông tin ở tài khoản cá nhân trước khi đặt hàng!!!

source: Add to Cart
vi: Thêm vào Giỏ hàng

source: Add a Review
vi: Thêm Đánh Giá

source: Rating:
vi: Điểm:

source: Review:
vi: Đánh Giá:

source: Submit Review
vi: Gửi Đánh giá

source: Login To Add Review
vi: Đăng Nhập Để Đánh Giá

source: No reviews yet.
vi: Chưa có đắnh giá về sản phẩm.

source: Pay
vi: Thanh Toán

source: HOME
vi: TR.CHỦ

source: MENU
vi: T.ĐƠN

source: ABOUT
vi: VỀ HYNIU

source: Contact Us
vi: Liên Hệ Chúng Tôi

source: Call Huy: +84 343036100
vi: Gọi Huy: +84 343036100

source: The most important thing is always the customer's taste and the reliability of the food
vi: Điều quan trọng nhất với chúng tôi luôn là trải nghiệm của khách hàng và chất lượng của món ăn

source: We are honored to serve you
vi: Được phục vụ quý khách là vinh hạnh của chúng tôi

source: Opening Hours
vi: Giờ Mở Cửa

source: Everyday
vi: Mỗi ngày

source: We are Hyniu restaurant, managed by Le Quang Huy and Doan Quang Liu with a chain of 507 stores worldwide.
vi: Chúng tôi là nhà hàng Hyniu, được quản lý bởi Lê Quang Huy và Đoàn Quang Liu với một chuỗi 507 nhà hàng trên toàn thế giới.

source: Welcome to Hyniu Food & Drink!
vi: Chào mừng bạn đến với Hyniu Food & Drink!

source: Your username or password didn't match. Please try again.
vi: Tên đăng nhập và mật khẩu của bạn không khớp. Hãy thử lại

source: Username
vi: Tên Đăng Nhập

source: Password
vi: Mật Khẩu

source: Don't have an account yet?
vi: Chưa có tài khoản?

source: Register Now!
vi: Đăng Ký Ngay!

source: Profile
vi: Thông tin

source: Please Fill Out This Field
vi: Hãy Điền Vào Trường Này

source: Save Changes
vi: Lưu Thay Đổi

source: Logout
vi: Đăng Xuất

source: Register
vi: Đăng Ký

source: Confirm Password
vi: Xác Nhận Mật Khẩu

source: Already have an account?
vi: Đã có tài khoản?

source: Login here!
vi: Đăng nhập ở đây!

source: Call Liu: +84 394188326
vi: Gọi Liu: +84 394188326

source: Your order has been cancelled!
vi: Đơn hàng của bạn đã được hủy

source: Cancel Order
vi: Hủy đơn hàng

source: Your order has been paid!
vi: Đơn hàng của bạn đã được thanh toán!

source: Order Date:
vi: Thời Gian Đặt:

source: User's Status:
vi: Trạng Thái Đơn Hàng:

source: Parent
vi: Nhánh Cha

source: Phone
vi: SĐT

source: Address
vi: Địa Chỉ

source: Milk Tea
vi: Trà Sữa

source: Snack
vi: Đồ Ăn Nhẹ

source: Soda
vi: Nước Ngọt

source: Coffee
vi: Cà phê

source: Fried Chicken
vi: Gà Rán

source: White coffee
vi: Bạc Xỉu

source: white coffee is used to refer to regular black coffee that has had milk, cream or some other whitener added to it
vi: Bạc Xỉu được dùng để chỉ cà phê đen thông thường được thêm sữa, kem vào để tăng vị ngon, thơm ngậy.

source: Black Coffee
vi: Cà phê đen

source: Coffee served as a beverage without cream or milk.
vi: Cà phê được phục vụ như nguyên bản, không có kem hoặc sữa.

source: Egg coffee
vi: Cà phê trứng

source: An egg coffee is a Vietnamese drink traditionally prepared with egg yolks, sugar, condensed milk and robusta coffee.
vi: Cà phê trứng là thức uống truyền thống của người Việt được pha chế với lòng đỏ trứng, đường, sữa đặc và cà phê Robusta.

source: Variations of the drink involve the use of cream instead of milk, using non-dairy milk substitutes and flavoring with cinnamon (in the United States) or chocolate powder (in Europe).
vi: Các biến thể của đồ uống liên quan đến việc sử dụng kem thay vì sữa, sử dụng các sản phẩm thay thế sữa không phải sữa và hương liệu với quế (ở Hoa Kỳ) hoặc bột sô cô la (ở Châu Âu).

source: A coffee drink of Italian origin made with espresso and steamed milk. Variants include the chocolate-flavored mocha or replacing the coffee with another beverage base such as masala chai (spiced Indian tea), mate, matcha, turmeric or rooibos.
vi: Một thức uống cà phê có nguồn gốc từ Ý được pha bằng espresso và sữa hấp. Các biến thể bao gồm mocha có hương vị sô cô la hoặc thay thế cà phê bằng một loại đồ uống khác như masala chai (trà gia vị Ấn Độ), mate, matcha, nghệ hoặc rooibos.

source: Mushroom Chicken Pizza
vi: Pizza Gà Nấm

source: Delicious pizza with roasted chicken, mushrooms, spinach, and homemade kale pesto sauce. An easy, fun, and healthful pizza!
vi: Bánh pizza thơm ngon với thịt gà nướng, nấm, rau bina và sốt pesto cải xoăn tự làm. Một chiếc bánh pizza dễ dàng, thú vị và tốt cho sức khỏe!

source: Seafood Pizza
vi: Pizza Hải Sản

source: Seafood pizza is pizza prepared with seafood as a primary ingredient.
vi: Pizza hải sản là một loại pizza được làm với hải sản là thành phần chính.

source: Veggie Pizza
vi: Pizza Rau Củ

source: This veggie pizza is made from crescent-roll dough and a cream cheesy spread for an easy, fresh take on a favorite-packed with crunchy
vi: Pizza rau củ này được làm từ bột láng và một lớp kem phô mai mịn màng để tạo ra một phiên bản mới dễ làm, tươi mát của món ăn ưa thích-đậy ắp vị giòn.

source: Mixed Pizza
vi: Pizza Thập Cẩm

source: Mixed pizza is a type of pizza that combines ingredients from many other types of pizza such as seafood, vegetables, chicken, sausage...
vi: Pizza thập cẩm là một loại pizza kết hợp các thành phần từ nhiều loại pizza khác nhau như hải sản, rau cải, gà, xúc xích...

source: Sausage Pizza
vi: Pizza Xúc Xích

source: Sausage pizza with the main ingredient being delicious sausages covered with fatty cheese and a crispy crust.
vi: Pizza xúc xích với thành phần chính là xúc xích thơm ngon được phủ bởi lớp phô mai béo và lớp vỏ giòn.

source: Fried Chicken Wings
vi: Cánh Gà Chiên

source: Crispy fried chicken wings with HyNiu's special recipe makes the chicken wings delicious and crispy
vi: Cánh gà chiên giòn với công thức đặc biệt của HyNiu tạo nên hương vị ngon và giòn.

source: Fried Chicken Thighs
vi: Đùi Gà Chiên

source: Crispy fried chicken thighs with HyNiu's special recipe helps make the chicken wings delicious and crispy
vi: Đùi gà chiên giòn với công thức đặc biệt của HyNiu giúp đùi gà ngon và giòn.

source: Hyniu's Sauce Fried Chicken
vi: Cánh Gà Chiên Sốt Hyniu

source: Crispy fried chicken with exclusive Hyniu sauce, sweet and spicy flavor, our formula has been researched for 5 years to perfect, giving you a wonderful experience.
vi: Cánh gà chiên giòn với sốt Hyniu độc đáo, hương vị ngọt và cay, công thức của chúng tôi đã được nghiên cứu trong 5 năm để hoàn thiện, mang đến cho bạn trải nghiệm tuyệt vời.

source: Chicken Pieces
vi: Gà Miếng

source: Never get tired of eating our crispy fried chicken breast, with HyNiu restaurant's exclusive recipe and method.
vi: Không bao giờ chán khi ăn miếng gà chiên giòn của chúng tôi, với công thức và phương pháp độc quyền của nhà hàng HyNiu.

source: Cheese Chicken
vi: Gà Phô Mai

source: Crispy fried chicken pieces combined with cheese sauce create a unique yet appealing flavor
vi: Miếng gà chiên giòn kết hợp với sốt phô mai tạo nên hương vị độc đáo nhưng hấp dẫn.

source: Sunflower Seed
vi: Hạt Hướng Dương

source: Sunflower seeds are a source of many vitamins and minerals that can support your immune system and increase your ability to fight off viruses.
vi: Hạt hướng dương là nguồn cung cấp nhiều loại vitamin và khoáng chất có thể hỗ trợ hệ miễn dịch và tăng khả năng chống lại vi khuẩn.

source: Coconut Flavored Sunflower Seeds
vi: Hạt Hướng Dương Vị Dừa

source: Sunflower seeds combine delicious coconut flavor
vi: Hạt hướng dương kết hợp với hương vị dừa thơm ngon.

source: Chicken Feet With Super Spicy Thai Sauce
vi: Chân Gà Sốt Thái Cực Cay

source: Chicken feet in Thai sauce is a super delicious snack with the sour, spicy taste of the sauce mixed with deliciously crispy chicken feet.
vi: Chân gà sốt Thái là món ăn nhẹ ngon tuyệt vời với hương vị chua cay của sốt hòa quyện với chân gà giòn thơm.

source: French Fries
vi: Khoai Tây Chiên

source: Prepared by cutting potatoes into even strips, drying them and frying them in a deep fryer.
vi: Chuẩn bị bằng cách cắt khoai tây thành từng thanh đều, sấy khô và chiên trong nồi chảo sâu.

source: Chinese Sausage
vi: Lạp Xưởng

source: The southern flavor of Chinese sausage is commonly known by its Cantonese name lap cheong.
vi: Hương vị phương Nam của lạp xưởng Trung Quốc thường được biết đến bằng tên gọi tiếng Quảng Đông là 'lạp xưởng'.

source: Fried Squid
vi: Mực Chiên Giòn

source: Fried calamari is one of the most classic appetizers made of lightly battered rings of squid quickly fried and served with a marinara sauce.
vi: Mực chiên giòn là một trong những món khai vị cổ điển nhất, được làm từ những vòng mực bọc bột nhẹ, nhanh chóng chiên và thường được phục vụ kèm sốt marinara.

source: Lumpia Goreng
vi: Chả Giò Indo

source: Lumpia goreng is a simple Indonesian fried spring roll filled with vegetables. The spring roll wrappers are filled with chopped, matchstick-sized carrots, shredded cabbage, and sometimes mushrooms.
vi: Chả giò Indonesia là một loại bánh quyện chiên ngon và đơn giản, được làm từ bánh tráng cuốn và nhân bên trong bao gồm cà rốt băm nhỏ, cải bắp băm mỏng và đôi khi còn có nấm.

source: Sausage
vi: Lạp Xưởng

source: A sausage is a type of meat product usually made from ground meat-often pork, beef, or poultry-along with salt, spices and other flavourings.
vi: Lạp xưởng là một loại sản phẩm từ thịt thường được làm từ thịt băm - thường là thịt lợn, bò hoặc gia cầm - kèm theo muối, gia vị và các hương liệu khác.

source: Black Sugar Pearl Milk Tea
vi: Trà Sữa Chân Trâu Đường Đen

source: This drink is made from 3 ingredients, tapioca pearls, caramelised brown sugar and milk. It is the favorite drink of today's youth.
vi: Đồ uống này được làm từ 3 thành phần: ngọc trai sắn, đường đen caramel và sữa. Đây là thức uống yêu thích của giới trẻ ngày nay.

source: Melon Milk Tea
vi: Trà Sữa Dưa Lưới

source: Melon milk tea is a combination of the aromatic flavor of milk and the freshness of melon, bringing a wonderful experience.
vi: Trà sữa dưa lưới là sự kết hợp giữa hương vị thơm ngon của sữa và sự tươi mát của dưa lưới, mang đến một trải nghiệm tuyệt vời.

source: Golden Milk Tea
vi: Trà Sữa Hoàng Kim

source: As one of the hot topping dishes today, milk tea with golden pearls, in addition to its irresistible delicious taste, also brings a sense of elegance and beauty.
vi: Là một trong những món trà sữa phổ biến ngày nay, trà sữa với chân trâu hoàng kim, ngoài hương vị ngon khó cưỡng, còn mang lại một cảm giác thanh lịch và đẹp mắt.

source: HyNiu Milk Tea
vi: Trà Sữa HyNiu

source: HyNiu milk tea is one of the restaurant's most passionate dishes, with a secret combination of ingredients that has been thoroughly researched and tested, this drink brings a wonderful experience to both taste and sight.
vi: Trà sữa HyNiu là một trong những món ăn đặc biệt của nhà hàng, với sự kết hợp bí mật của các thành phần đã được nghiên cứu và thử nghiệm kỹ lưỡng, đồ uống này mang lại một trải nghiệm tuyệt vời cả về hương vị và thị giác.

source: Green Apple Milk Tea
vi: Trà Sữa Táo Xanh

source: Our Green Apple Green Tea tastes like a luscious apple with hints of caramel. Luxury Ingredients: Green tea, Apple pieces, Tamarind leaves, Natural flavors. Made with all natural flavorings.
vi: Trà sữa táo xanh của chúng tôi có hương vị giống như táo ngon với gợi ý của karamen. Thành phần xa xỉ: Trà xanh, miếng táo, lá me, hương liệu tự nhiên. Được làm với tất cả hương liệu tự nhiên.

source: Chocolate Milk Tea
vi: Trà sữa Sô Cô La

source: Rich in cocoa flavor with a taste of black tea, this makes it an ultimate comfort drink for customers.
vi: Với hương vị cacao đậm đà kết hợp với hương vị trà đen, đây là thức uống thúc đẩy sự thoải mái tối ưu cho khách hàng.

source: Pepsi is a popular carbonated beverage that many people eat every time.
vi: Pepsi là một thức uống có ga phổ biến mà nhiều người thích.

source: Lemon Soda
vi: Soda Chanh

source: This Lemon Soda has three basic ingredients and is the perfect balance of sweet, tart, and bubbly. It has the perfect level of sweetness, allowing the lemon flavor to shine through. If you love lemon or citrus drinks then you'll love this soda.
vi: Soda chanh này có ba thành phần cơ bản và là sự kết hợp hoàn hảo giữa hương vị ngọt ngào, chua chát và sủi bọt. Nó có độ ngọt hoàn hảo, cho phép hương vị chanh tỏa sáng. Nếu bạn yêu thích đồ uống chanh hoặc có hương vị chanh, thì bạn sẽ thích soda này.

source: Mint Soda
vi: Soda Bạc Hà

source: With its refreshing and fragrant flavor, mint is a welcome addition to both sweet and savory dishes.
vi: Với hương vị tươi mát và thơm ngon, bạc hà là một sự bổ sung đáng chào đón cho cả món ngọt và món mặn.

source: Strawberry Soda
vi: Soda Dâu

source: It's delicious in its own unique way! If a soda could taste “fresh”, this would be it.
vi: Nó ngon theo cách độc đáo của riêng nó! Nếu soda có thể có hương vị 'tươi mát', thì đây chính là loại soda đó.

source: Cool soda with exclusive HyNiu flavor, we believe this drink will give you a completely new experience of soda drinks.
vi: Soda mát lạnh với hương vị độc quyền của HyNiu, chúng tôi tin rằng đồ uống này sẽ mang lại cho bạn một trải nghiệm hoàn toàn mới về đồ uống soda.

source: Blueberry Soda
vi: Soda Việt Quất

source: Blueberries are a very popular fruit because of their delicious taste and many health benefits. Blueberry soda with the sweet and sour taste of blueberries, with cool soda,...
vi: Việt quất là một loại trái cây rất phổ biến vì hương vị ngon và nhiều lợi ích cho sức khỏe. Soda việt quất với hương vị ngọt chua của việt quất, kết hợp với soda mát,...

source: Kumquat And Aloe Vera Tea
vi: Trà Bưởi Và Lô Hội

source: A refreshing and nourishing beverage made from the gel extracted from the aloe vera plant. It offers a range of potential health benefits.
vi: Một thức uống mát lạnh và bổ dưỡng được làm từ gel chiết xuất từ cây lô hội. Nó mang lại nhiều lợi ích cho sức khỏe tiềm năng.

source: Beef Hamburger
vi: Hamburger Bò

source: The best burgers offer a combination of tastes and textures -sweet, sour, salt- with a bit of crunch.
vi: Những chiếc bánh mì kẹp thịt ngon nhất mang đến sự kết hợp giữa hương vị và kết cấu – ngọt, chua, muối – với một chút giòn.

source: Chicken Hamburgers
vi: Hamburger Gà

source: Chicken burgers are healthier than regular burgers. They're made with lean meat and most vegetables, so they're packed with nutrients and haven't got any added sugar or fat. Plus, they taste great! Second of all, chicken burgers are versatile.
vi: Bánh mì kẹp thịt gà tốt cho sức khỏe hơn bánh mì kẹp thịt thông thường. Chúng được làm từ thịt nạc và hầu hết các loại rau, vì vậy chúng chứa nhiều chất dinh dưỡng và không thêm đường hoặc chất béo. Thêm vào đó, chúng có hương vị tuyệt vời! Thứ hai, bánh mì kẹp thịt gà rất đa dạng.

source: Bamboo Charcoal Hamburger
vi: Hamburger Than Tre

source: If you can get past the shocking color, it's not bad. The black pepper in the patty hits you at the first bite and complements the tangy sauce, with its hint of squid ink.
vi: Nếu bạn có thể vượt qua được màu sắc gây sốc thì cũng không tệ. Hạt tiêu đen trong miếng chả sẽ cuốn hút bạn ngay từ miếng đầu tiên và hòa quyện với nước sốt thơm, thoang thoảng mùi mực ống.

source: 3-Layer Mixed Hamburger
vi: Hamburger Thập Cẩm 3 Tầng

source: The 3-layer mixed hamburger is a combination of beef, chicken and shrimp hamburgers, with each layer having 1 filling, that combination creates an unforgettable hamburger flavor.
vi: Hamburger thập cẩm 3 tầng là sự kết hợp giữa hamburger bò, gà và tôm, mỗi lớp có 1 nhân, sự kết hợp đó tạo nên hương vị hamburger khó quên.

source: Shrimp Hamburger
vi: Hamburger Tôm

source: Shrimp burgers are also just inherently delicious, with a springy texture that bursts with mildly sweet, irresistible umami flavor.
vi: Bánh mì kẹp thịt tôm vốn dĩ đã rất ngon, với kết cấu dẻo dai hòa cùng hương vị umami ngọt nhẹ, khó cưỡng.

source: 3 Person Combo
vi: Combo 3 Người

source: Combo includes 2 crispy fried chicken thighs, 2 chicken pieces, 2 cans of Pepsi, and 2 apple pies - special dish only available when purchasing combo.
vi: Combo gồm 2 đùi gà chiên giòn, 2 miếng gà, 2 lon Pepsi và 2 bánh táo - món ăn đặc biệt chỉ có khi mua combo.

source: 6 Delicious Fried Chicken highs Combo
vi: Combo 6 đùi gà chiên thơm ngon

source: Combo includes 6 delicious fried chicken thighs
vi: Combo gồm 6 đùi gà chiên thơm ngon

source: Hamburger Fried Chicken Combo
vi: Combo Hamburger Gà Chiên

source: Combo includes 1 delicious fried chicken thigh, 1 can of Pepsi and 1 chicken/beef/shrimp hamburger.
vi: Combo bao gồm 1 đùi gà rán thơm ngon, 1 lon Pepsi và 1 hamburger gà/bò/tôm.

source: Combo For 1 Person
vi: Combo 1 Người

source: combo for 1 person, combo includes 1 chicken thigh, 1 piece of fried chicken, 1 can of Pepsi, and 2 apple pies - special dish only available when purchasing combo
vi: Combo dành cho 1 người, combo gồm 1 đùi gà, 1 miếng gà rán, 1 lon Pepsi và 2 bánh táo - món ăn đặc biệt chỉ có khi mua combo

source: Super Ultra Big Flat Winnowing Basket
vi: Mẹt Khổng Lồ

source: Including dishes such as fish balls, sausages, shrimp balls, lap mill,...
vi: Gồm các món như cá viên, xúc xích, tôm viên, lạp xưởng,...

source: HyNiu Super Ultra Combo
vi: Combo Siêu Siêu HyNiu

source: Exclusive combo dishes researched and created by our restaurant, we guarantee you will have an unforgettable experience with unique but delicious flavors.
vi: Các món combo độc quyền được nghiên cứu và sáng tạo bởi nhà hàng chúng tôi, chúng tôi đảm bảo bạn sẽ có những trải nghiệm khó quên với hương vị độc đáo nhưng thơm ngon.

source: Accepted-Ongoing
vi: Shop đã nhận đơn
